common/models/User.php

SELECT * FROM `user` WHERE `id`='4'
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);