api/controllers/ApiController.php

    public function actionGet_users()
    {
        $models = User::find()->all();
---
SELECT * FROM `user`